PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rtc.h
#define RTC_CALIBRATION_WINDOW_32S         ((uint32_t)0x00000000U)                     /*!< 2exp20 RTCCLK cycles, 32s if RTCCLK = 32768 Hz */
#define RTC_CALIBRATION_WINDOW_16S         RTC_HRFC_CWND16                             /*!< 2exp19 RTCCLK cycles, 16s if RTCCLK = 32768 Hz */
#define RTC_CALIBRATION_WINDOW_8S          RTC_HRFC_CWND8                              /*!< 2exp18 RTCCLK cycles, 8s if RTCCLK = 32768 Hz */

#define RTC_TAMPER_TRIGGER_POS             ((uint32_t)0x00000001U)                     /* shift position of trigger relative to source */

/* RTC interrupt source */
#define RTC_INT_TIMESTAMP                  RTC_CTL_TSIE                                /*!< time-stamp interrupt enable */
#define RTC_INT_ALARM                      RTC_CTL_ALRM0IE                             /*!< RTC alarm interrupt enable */
#define RTC_INT_TAMP                       RTC_TAMP_TPIE                               /*!< tamper detection interrupt enable */

/* write protect key */
#define RTC_UNLOCK_KEY1                    ((uint8_t)0xCAU)                            /*!< RTC unlock key1 */
#define RTC_UNLOCK_KEY2                    ((uint8_t)0x53U)                            /*!< RTC unlock key2 */
#define RTC_LOCK_KEY                       ((uint8_t)0xFFU)                            /*!< RTC lock key */

/* registers reset value */
#define RTC_REGISTER_RESET                 ((uint32_t)0x00000000U)                     /*!< RTC common register reset value */
#define RTC_DATE_RESET                     ((uint32_t)0x00002101U)                     /*!< RTC_DATE register reset value */
#define RTC_STAT_RESET                     ((uint32_t)0x00000007U)                     /*!< RTC_STAT register reset value */
#define RTC_PSC_RESET                      ((uint32_t)0x007F00FFU)                     /*!< RTC_PSC register reset value */

/* daylight saving mark */
#define RTC_RECORD_DAYLIGHTSAVING_SET        RTC_CTL_DSM                /*!< set daylight saving mark */
#define RTC_RECORD_DAYLIGHTSAVING_RESET      ((uint32_t)0x00000000U)    /*!< reset daylight saving mark */

/* RTC timeout value */
#define RTC_INITM_TIMEOUT                  ((uint32_t)0x00004000U)                     /*!< initialization state flag timeout */
#define RTC_RSYNF_TIMEOUT                  ((uint32_t)0x00008000U)                     /*!< register synchronization flag timeout */
#define RTC_HRFC_TIMEOUT                   ((uint32_t)0x00001000U)                     /*!< recalibration pending flag timeout */
#define RTC_SHIFTCTL_TIMEOUT               ((uint32_t)0x00001000U)                     /*!< shift function operation pending flag timeout */
#define RTC_ALRM0WF_TIMEOUT                ((uint32_t)0x00008000U)                     /*!< alarm configuration can be write flag timeout */

/* RTC flag */
#define RTC_FLAG_RECALIBRATION             RTC_STAT_SCPF                               /*!< recalibration pending flag */
#define RTC_FLAG_TAMP1                     RTC_STAT_TP1F                               /*!< tamper 1 event flag */
#define RTC_FLAG_TAMP0                     RTC_STAT_TP0F                               /*!< tamper 0 event flag */
#define RTC_FLAG_TIMESTAMP_OVERFLOW        RTC_STAT_TSOVRF                             /*!< time-stamp overflow event flag */
#define RTC_FLAG_TIMESTAMP                 RTC_STAT_TSF                                /*!< time-stamp event flag */
#define RTC_FLAG_ALARM0                    RTC_STAT_ALRM0F                             /*!< alarm event flag */
#define RTC_FLAG_INIT                      RTC_STAT_INITF                              /*!< init mode event flag */
#define RTC_FLAG_RSYN                      RTC_STAT_RSYNF                              /*!< registers synchronized flag */
#define RTC_FLAG_YCM                       RTC_STAT_YCM                                /*!< year parameter configured event flag */
#define RTC_FLAG_SHIFT                     RTC_STAT_SOPF                               /*!< shift operation pending flag */
#define RTC_FLAG_ALARM0_WRITTEN            RTC_STAT_ALRM0WF                            /*!< alarm written available flag */

/* RTC state enum */
typedef enum {
    HAL_RTC_STATE_NONE = 0,                                                            /*!< NONE(default value) */
    HAL_RTC_STATE_RESET,                                                               /*!< RESET */
    HAL_RTC_STATE_BUSY,                                                                /*!< BUSY */
    HAL_RTC_STATE_TIMEOUT,                                                             /*!< TIMEOUT */
    HAL_RTC_STATE_ERROR,                                                               /*!< ERROR */
    HAL_RTC_STATE_READY                                                                /*!< READY */
} hal_rtc_state_enum;

/* RTC error type enum */
typedef enum {
    HAL_RTC_ERROR_NONE             = (uint32_t)0x00U,                                  /*!< no error */
    HAL_RTC_ERROR_SYSTEM           = (uint32_t)0x01U,                                  /*!< RTC internal error: if problem of clocking, enable/disable, wrong state */
    HAL_RTC_ERROR_CONFIG           = (uint32_t)0x04U                                   /*!< configuration error occurs */
} hal_rtc_error_enum;

/* RTC structure type enum */
typedef enum {
    HAL_RTC_INIT_STRUCT = 0,                                                           /*!< RTC init structure */
    HAL_RTC_ALARM_OUTPUT_CONFIG_STRUCT,                                                /*!< RTC alarm output config structure */
    HAL_RTC_ALARM_CONFIG_STRUCT,                                                       /*!< RTC alarm config structure */
    HAL_RTC_TAMPER_CONFIG_STRUCT,                                                      /*!< RTC tamper config structure */
    HAL_RTC_TIMESTAMP_STRUCT,                                                          /*!< RTC timestamp config structure */
    HAL_RTC_IRQ_STRUCT,                                                                /*!< RTC irq structure */
    HAL_RTC_DEV_STRUCT                                                                 /*!< RTC device structure */
} hal_rtc_struct_type_enum;

/* RTC device interrupt callback function pointer structure */
typedef struct {
    __IO hal_irq_handle_cb           rtc_timestamp_handle;                             /*!< RTC timestamp handler function */
    __IO hal_irq_handle_cb           rtc_alarm_handle;                                 /*!< RTC alarm handler function */
    __IO hal_irq_handle_cb           rtc_tamper0_handle;                                 /*!< RTC tamper0 handler function */
    __IO hal_irq_handle_cb           rtc_tamper1_handle;                                 /*!< RTC tamper1 handler function */
} hal_rtc_irq_struct;

/* RTC device information structrue */
typedef struct {
    hal_rtc_irq_struct               rtc_irq;                                          /*!< RTC device interrupt callback function pointer structure */
    hal_rtc_error_enum               error_state;                                      /*!< RTC error state */
    hal_rtc_state_enum               state;                                            /*!< RTC state */
    hal_mutex_enum                   mutex;                                            /*!< mutex */
    void                             *priv;                                            /*!< priv data */
} hal_rtc_dev_struct;

/* structure for RTC time-stamp configuration */
typedef struct {
    uint8_t rtc_timestamp_month;                                                       /*!< RTC time-stamp month value */
    uint8_t rtc_timestamp_date;                                                        /*!< RTC time-stamp date value: 1 - 31 */
    uint8_t rtc_timestamp_weekday;                                                     /*!< RTC time-stamp weekday value */
    uint8_t rtc_timestamp_hour;                                                        /*!< RTC time-stamp hour value */
    uint8_t rtc_timestamp_minute;                                                      /*!< RTC time-stamp minute value: 0 - 59 */
    uint8_t rtc_timestamp_second;                                                      /*!< RTC time-stamp second value: 0 - 59 */
    uint32_t rtc_timestamp_subsecond;                                                  /*!< RTC time-stamp subsecond value: 0x0 - 0xFFFF */
    uint32_t rtc_am_pm;                                                                /*!< RTC time-stamp AM/PM value */
} hal_rtc_timestamp_struct;

/* @PARA: rtc_init */
/* @STRUCT: RTC init struct */
typedef struct{
    uint8_t rtc_year;                                                                  /*!< RTC year value: 0 - 99 */
    uint8_t rtc_month;                                                                 /*!< RTC month value */
    uint8_t rtc_date;                                                                  /*!< RTC date value: 1 - 31 */
    uint8_t rtc_day_of_week;                                                           /*!< RTC weekday value */
    uint8_t rtc_hour;                                                                  /*!< RTC hour value */
    uint8_t rtc_minute;                                                                /*!< RTC minute value: 0 - 59 */
    uint8_t rtc_second;                                                                /*!< RTC second value: 0 - 59 */
    uint16_t rtc_subsecond;                                                            /*!< RTC subsecond value: 0x0 - 0xFFFF */
    uint32_t rtc_am_pm;                                                                /*!< RTC AM/PM value */
    uint32_t rtc_daylight_saving;                                                      /*!< RTC daylight saving */
    uint32_t rtc_clock_format;                                                         /*!< RTC display format of clock system */
    uint16_t rtc_psc_factor_s;                                                         /*!< RTC synchronous prescaler value: 0x0 - 0x7FFF */
    uint16_t rtc_psc_factor_a;                                                         /*!< RTC asynchronous prescaler value: 0x0 - 0x7F */
}hal_rtc_init_struct;

/* @STRUCT_MEMBER: rtc_year */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_month */
/* @DEFINE: RTC month value */
#define RTC_JAN                            ((uint8_t)0x01U)                            /*!< Janurary */
#define RTC_FEB                            ((uint8_t)0x02U)                            /*!< February */
#define RTC_MAR                            ((uint8_t)0x03U)                            /*!< March */
#define RTC_APR                            ((uint8_t)0x04U)                            /*!< April */
#define RTC_MAY                            ((uint8_t)0x05U)                            /*!< May */
#define RTC_JUN                            ((uint8_t)0x06U)                            /*!< June */
#define RTC_JUL                            ((uint8_t)0x07U)                            /*!< July */
#define RTC_AUG                            ((uint8_t)0x08U)                            /*!< August */
#define RTC_SEP                            ((uint8_t)0x09U)                            /*!< September */
#define RTC_OCT                            ((uint8_t)0x10U)                            /*!< October */
#define RTC_NOV                            ((uint8_t)0x11U)                            /*!< November */
#define RTC_DEC                            ((uint8_t)0x12U)                            /*!< December */
/* @STRUCT_MEMBER: rtc_date */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_day_of_week */
/* @DEFINE: RTC weekday value */
#define RTC_MONDAY                         ((uint8_t)0x01U)                            /*!< Monday */
#define RTC_TUESDAY                        ((uint8_t)0x02U)                            /*!< Tuesday */
#define RTC_WEDSDAY                        ((uint8_t)0x03U)                            /*!< Wednesday */
#define RTC_THURSDAY                       ((uint8_t)0x04U)                            /*!< Thursday */
#define RTC_FRIDAY                         ((uint8_t)0x05U)                            /*!< Friday */
#define RTC_SATURDAY                       ((uint8_t)0x06U)                            /*!< Saturday */
#define RTC_SUNDAY                         ((uint8_t)0x07U)                            /*!< Sunday */
/* @STRUCT_MEMBER: rtc_hour */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_minute */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_second */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_am_pm */
/* @DEFINE: RTC AM/PM value */
#define RTC_AM                             ((uint32_t)0x00000000U)                     /*!< AM format */
#define RTC_PM                             RTC_TIME_PM                                 /*!< PM format */
/* @STRUCT_MEMBER: rtc_daylight_saving */
/* @DEFINE: daylight saving */
#define RTC_DAYLIGHT_SAVING_NONE          ((uint32_t)0x00000000U)                      /*!< no daylight saving */
#define RTC_DAYLIGHT_SAVING_ADD_1H        RTC_CTL_A1H                                  /*!< add 1 hour(summer time change) */
#define RTC_DAYLIGHT_SAVING_SUB_1H        RTC_CTL_S1H                                  /*!< subtract 1 hour(winter time change) */
/* @STRUCT_MEMBER: rtc_clock_format */
/* @DEFINE: display format of clock system */
#define RTC_24H_FORMAT                    ((uint32_t)0x00000000U)                      /*!< 24-hour format */
#define RTC_12H_FORMAT                    RTC_CTL_CS                                   /*!< 12-hour format */
/* @STRUCT_MEMBER: rtc_psc_factor_s */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_psc_factor_a */
/* @=NULL */
/* @FUNCTION: init RTC */
int32_t hal_rtc_init(hal_rtc_dev_struct *rtc_dev, hal_rtc_init_struct *rtc_init);

