PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rtc.h
/* @PARA: rtc_alarm_output_config */
/* @STRUCT: RTC alarm out config struct */
typedef struct {
    uint32_t rtc_alarm_output_polarity;                                                /*!< alarm output polarity */
    uint32_t rtc_alarm_output_type;                                                    /*!< alarm output type control/PC13 output value */
} hal_rtc_alarm_output_config_struct;
/* @STRUCT_MEMBER: rtc_alarm_output_polarity */
/* @DEFINE: output polarity */
#define RTC_ALARM_HIGH                    ((uint32_t)0x00000000U)                      /*!< enable alarm flag output with high level */
#define RTC_ALARM_LOW                     RTC_CTL_OPOL                                 /*!< enable alarm flag output with low level */
/* @STRUCT_MEMBER: rtc_alarm_output_type */
/* @DEFINE: alarm output type control/PC13 output value */
#define RTC_ALARM_OUTPUT_OD               ((uint32_t)0x00000000U)                      /*!< RTC alarm output open-drain mode */
#define RTC_ALARM_OUTPUT_PP               RTC_TAMP_PC13VAL                             /*!< RTC alarm output push-pull mode */
/* @FUNCTION: configure RTC alarm output */
int32_t hal_rtc_alarm_output_config(hal_rtc_dev_struct *rtc_dev, hal_rtc_alarm_output_config_struct *rtc_alarm_output_config);

/* @PARA: rtc_alarm_config */
/* @STRUCT: RTC alarm config struct */
typedef struct {
    uint32_t rtc_alarm_am_pm;                                                          /*!< RTC alarm AM/PM value */
    uint32_t rtc_alarm_weekday_mask;                                                   /*!< RTC alarm weekday mask */
    uint32_t rtc_alarm_hour_mask;                                                      /*!< RTC alarm hour mask */
    uint32_t rtc_alarm_minute_mask;                                                    /*!< RTC alarm minute mask */
    uint32_t rtc_alarm_second_mask;                                                    /*!< RTC alarm second mask */
    uint32_t rtc_alarm_subsecond_mask;                                                 /*!< RTC alarm subsecond mask */
    uint32_t rtc_weekday_or_date;                                                      /*!< specify RTC alarm is on date or weekday */
    uint32_t rtc_alarm_day;                                                            /*!< RTC alarm date or weekday value */
    uint32_t rtc_alarm_hour;                                                           /*!< RTC alarm hour value */
    uint32_t rtc_alarm_minute;                                                         /*!< RTC alarm minute value: 0 - 59 */
    uint32_t rtc_alarm_second;                                                         /*!< RTC alarm second value: 0 - 59 */
    uint32_t rtc_alarm_subsecond;                                                      /*!< RTC alarm subsecond value: 0x0 - 0x7FFF */
} hal_rtc_alarm_config_struct;
/* @STRUCT_MEMBER: rtc_alarm_am_pm */
/* @DEFINE: RTC alarm AM/PM value */
#define RTC_ALARM_AM                             ((uint32_t)0x00000000U)               /*!< AM format */
#define RTC_ALARM_PM                             RTC_TIME_PM                           /*!< PM format */
/* @STRUCT_MEMBER: rtc_alarm_weekday_mask */
/* @DEFINE: RTC alarm weekday mask */
#define RTC_ALARM_WEEKDAY_MASK_DISABLE           ((uint32_t)0x00000000U)               /*!< RTC alarm weekday no mask */
#define RTC_ALARM_WEEKDAY_MASK_ENABLE            RTC_ALRM0TD_MSKD                      /*!< RTC alarm weekday mask */
/* @STRUCT_MEMBER: rtc_alarm_hour_mask */
/* @DEFINE: RTC alarm hour mask */
#define RTC_ALARM_HOUR_MASK_DISABLE              ((uint32_t)0x00000000U)               /*!< RTC alarm hour no mask */
#define RTC_ALARM_HOUR_MASK_ENABLE               RTC_ALRM0TD_MSKH                      /*!< RTC alarm hour mask */
/* @STRUCT_MEMBER: rtc_alarm_minute_mask */
/* @DEFINE: RTC alarm minute mask */
#define RTC_ALARM_MINUTE_MASK_DISABLE            ((uint32_t)0x00000000U)               /*!< RTC alarm minute no mask */
#define RTC_ALARM_MINUTE_MASK_ENABLE             RTC_ALRM0TD_MSKM                      /*!< RTC alarm minute mask */
/* @STRUCT_MEMBER: rtc_alarm_second_mask */
/* @DEFINE: RTC alarm second mask */
#define RTC_ALARM_SECOND_MASK_DISABLE            ((uint32_t)0x00000000U)               /*!< RTC alarm second no mask */
#define RTC_ALARM_SECOND_MASK_ENABLE             RTC_ALRM0TD_MSKS                      /*!< RTC alarm second mask */
/* @STRUCT_MEMBER: rtc_alarm_subsecond_mask */
/* @DEFINE: RTC alarm sub-second mask */
#define RTC_MASKSSC_0_14                         ALRM0SS_MASKSSC(0)                    /*!< mask alarm subsecond configuration */
#define RTC_MASKSSC_1_14                         ALRM0SS_MASKSSC(1)                    /*!< mask RTC_ALRM0SS_SSC[14:1], and RTC_ALRM0SS_SSC[0] is to be compared */
#define RTC_MASKSSC_2_14                         ALRM0SS_MASKSSC(2)                    /*!< mask RTC_ALRM0SS_SSC[14:2], and RTC_ALRM0SS_SSC[1:0] is to be compared */
#define RTC_MASKSSC_3_14                         ALRM0SS_MASKSSC(3)                    /*!< mask RTC_ALRM0SS_SSC[14:3], and RTC_ALRM0SS_SSC[2:0] is to be compared */
#define RTC_MASKSSC_4_14                         ALRM0SS_MASKSSC(4)                    /*!< mask RTC_ALRM0SS_SSC[14:4], and RTC_ALRM0SS_SSC[3:0] is to be compared */
#define RTC_MASKSSC_5_14                         ALRM0SS_MASKSSC(5)                    /*!< mask RTC_ALRM0SS_SSC[14:5], and RTC_ALRM0SS_SSC[4:0] is to be compared */
#define RTC_MASKSSC_6_14                         ALRM0SS_MASKSSC(6)                    /*!< mask RTC_ALRM0SS_SSC[14:6], and RTC_ALRM0SS_SSC[5:0] is to be compared */
#define RTC_MASKSSC_7_14                         ALRM0SS_MASKSSC(7)                    /*!< mask RTC_ALRM0SS_SSC[14:7], and RTC_ALRM0SS_SSC[6:0] is to be compared */
#define RTC_MASKSSC_8_14                         ALRM0SS_MASKSSC(8)                    /*!< mask RTC_ALRM0SS_SSC[14:8], and RTC_ALRM0SS_SSC[7:0] is to be compared */
#define RTC_MASKSSC_9_14                         ALRM0SS_MASKSSC(9)                    /*!< mask RTC_ALRM0SS_SSC[14:9], and RTC_ALRM0SS_SSC[8:0] is to be compared */
#define RTC_MASKSSC_10_14                        ALRM0SS_MASKSSC(10)                   /*!< mask RTC_ALRM0SS_SSC[14:10], and RTC_ALRM0SS_SSC[9:0] is to be compared */
#define RTC_MASKSSC_11_14                        ALRM0SS_MASKSSC(11)                   /*!< mask RTC_ALRM0SS_SSC[14:11], and RTC_ALRM0SS_SSC[10:0] is to be compared */
#define RTC_MASKSSC_12_14                        ALRM0SS_MASKSSC(12)                   /*!< mask RTC_ALRM0SS_SSC[14:12], and RTC_ALRM0SS_SSC[11:0] is to be compared */
#define RTC_MASKSSC_13_14                        ALRM0SS_MASKSSC(13)                   /*!< mask RTC_ALRM0SS_SSC[14:13], and RTC_ALRM0SS_SSC[12:0] is to be compared */
#define RTC_MASKSSC_14                           ALRM0SS_MASKSSC(14)                   /*!< mask RTC_ALRM0SS_SSC[14], and RTC_ALRM0SS_SSC[13:0] is to be compared */
#define RTC_MASKSSC_NONE                         ALRM0SS_MASKSSC(15)                   /*!< mask none, and RTC_ALRM0SS_SSC[14:0] is to be compared */
/* @STRUCT_MEMBER: rtc_weekday_or_date */
/* @DEFINE: specify RTC alarm is on date or weekday */
#define RTC_ALARM_SELECT_WEEKDAY                 RTC_ALRM0TD_DOWS                      /*!< RTC alarm select weekday */
#define RTC_ALARM_SELECT_DATE                    ((uint32_t)0x00)                      /*!< RTC alarm select date */
/* @STRUCT_MEMBER: rtc_alarm_day */
/* @DEFINE: RTC alarm date or weekday value */
#define RTC_ALARM_MONDAY                         ((uint8_t)0x01U)                      /*!< RTC alarm Monday */
#define RTC_ALARM_TUESDAY                        ((uint8_t)0x02U)                      /*!< RTC alarm Tuesday */
#define RTC_ALARM_WEDSDAY                        ((uint8_t)0x03U)                      /*!< RTC alarm Wednesday */
#define RTC_ALARM_THURSDAY                       ((uint8_t)0x04U)                      /*!< RTC alarm Thursday */
#define RTC_ALARM_FRIDAY                         ((uint8_t)0x05U)                      /*!< RTC alarm Friday */
#define RTC_ALARM_SATURDAY                       ((uint8_t)0x06U)                      /*!< RTC alarm Saturday */
#define RTC_ALARM_SUNDAY                         ((uint8_t)0x07U)                      /*!< RTC alarm Sunday */
/* @STRUCT_MEMBER: rtc_alarm_hour */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_alarm_minute */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_alarm_second */
/* @=NULL */
/* @STRUCT_MEMBER: rtc_alarm_subsecond */
/* @=NULL */
/* @FUNCTION: configure RTC alarm */
int32_t hal_rtc_alarm_config(hal_rtc_dev_struct *rtc_dev, hal_rtc_alarm_config_struct *rtc_alarm_config);

/* @PARA: rtc_tamper_config */
/* @STRUCT: RTC  config struct */
typedef struct {
    uint32_t rtc_tamper_filter;                                                        /*!< RTC tamper consecutive samples needed during a voltage level detection */
    uint32_t rtc_tamper_sample_frequency;                                              /*!< RTC tamper sampling frequency during a voltage level detection */
    uint32_t rtc_tamper_precharge_time;                                                /*!< RTC tamper precharge duration if precharge feature is enabled */
    uint32_t rtc_tamper_precharge_enable;                                              /*!< RTC tamper precharge feature during a voltage level detection */
    uint32_t rtc_tamper_with_timestamp;                                                /*!< RTC tamper time-stamp feature */
    uint32_t rtc_tamper0_trigger;                                                      /*!< RTC tamper0 trigger */
    uint32_t rtc_tamper1_trigger;                                                      /*!< RTC tamper1 trigger */
    ControlStatus rtc_tamper0_source;                                                  /*!< RTC tamper0 source */
    ControlStatus rtc_tamper1_source;                                                  /*!< RTC tamper1 source */
} hal_rtc_tamper_config_struct;
