PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rtc.h
/* @STRUCT_MEMBER: rtc_tamper_filter */
/* @DEFINE: RTC tamper consecutive samples needed during a voltage level detection */
#define RTC_FLT_EDGE                       TAMP_FLT(0)                                 /*!< detecting tamper event using edge mode. precharge duration is disabled automatically */
#define RTC_FLT_2S                         TAMP_FLT(1)                                 /*!< detecting tamper event using level mode.2 consecutive valid level samples will make a effective tamper event */
#define RTC_FLT_4S                         TAMP_FLT(2)                                 /*!< detecting tamper event using level mode.4 consecutive valid level samples will make an effective tamper event */
#define RTC_FLT_8S                         TAMP_FLT(3)                                 /*!< detecting tamper event using level mode.8 consecutive valid level samples will make a effective tamper event */
/* @STRUCT_MEMBER: rtc_tamper_sample_frequency */
/* @DEFINE: RTC tamper sampling frequency during a voltage level detection */
#define RTC_FREQ_DIV32768                  TAMP_FREQ(0)                                /*!< sample once every 32768 RTCCLK(1Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV16384                  TAMP_FREQ(1)                                /*!< sample once every 16384 RTCCLK(2Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV8192                   TAMP_FREQ(2)                                /*!< sample once every 8192 RTCCLK(4Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV4096                   TAMP_FREQ(3)                                /*!< sample once every 4096 RTCCLK(8Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV2048                   TAMP_FREQ(4)                                /*!< sample once every 2048 RTCCLK(16Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV1024                   TAMP_FREQ(5)                                /*!< sample once every 1024 RTCCLK(32Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV512                    TAMP_FREQ(6)                                /*!< sample once every 512 RTCCLK(64Hz if RTCCLK=32.768KHz) */
#define RTC_FREQ_DIV256                    TAMP_FREQ(7)                                /*!< sample once every 256 RTCCLK(128Hz if RTCCLK=32.768KHz) */
/* @STRUCT_MEMBER: rtc_tamper_precharge_time */
/* @DEFINE: RTC tamper precharge duration if precharge feature is enabled */
#define RTC_PRCH_1C                        TAMP_PRCH(0)                                /*!< 1 RTC clock prechagre time before each sampling */
#define RTC_PRCH_2C                        TAMP_PRCH(1)                                /*!< 2 RTC clock prechagre time before each sampling */
#define RTC_PRCH_4C                        TAMP_PRCH(2)                                /*!< 4 RTC clock prechagre time before each sampling */
#define RTC_PRCH_8C                        TAMP_PRCH(3)                                /*!< 8 RTC clock prechagre time before each sampling */
/* @STRUCT_MEMBER: rtc_tamper_precharge_enable */
/* @DEFINE: RTC tamper precharge feature during a voltage level detection */
#define RTC_PRCH_DISALE                     RTC_TAMP_DISPU                             /*!< RTC tamper precharge feature disable during a voltage level detection */
#define RTC_PRCH_ENALE                      ((uint8_t)(0x0))                           /*!< RTC tamper precharge feature enable during a voltage level detection */
/* @STRUCT_MEMBER: rtc_tamper_with_timestamp */
/* @DEFINE: RTC tamper time-stamp feature */
#define RTC_TAMPER_TIMESTAMP_DISALE         ((uint8_t)(0x0))                           /*!< RTC tamper time-stamp feature disable */
#define RTC_TAMPER_TIMESTAMP_ENALE          RTC_TAMP_TPTS                              /*!< RTC tamper time-stamp feature enable */
/* @STRUCT_MEMBER: rtc_tamper0_trigger */
/* @DEFINE: RTC tamper0 trigger */
#define RTC_TAMPER_TRIGGER_EDGE_RISING      ((uint32_t)(0x00000000))                   /*!< tamper detection is in rising edge mode */
#define RTC_TAMPER_TRIGGER_EDGE_FALLING     ((uint32_t)(0x00000001))                   /*!< tamper detection is in falling edge mode */
#define RTC_TAMPER_TRIGGER_LEVEL_LOW        ((uint32_t)(0x00000000))                   /*!< tamper detection is in low level mode */
#define RTC_TAMPER_TRIGGER_LEVEL_HIGH       ((uint32_t)(0x00000001))                   /*!< tamper detection is in high level mode */
/* @STRUCT_MEMBER: rtc_tamper1_trigger */
/* @DEFINE: RTC tamper1 trigger */
/* @REFER: RTC_TAMPER_TRIGGER_EDGE_RISING */
/* @PARA: rtc_tamper0_source */
/* @SP: ENABLE/DISABLE */
/* @PARA: rtc_tamper1_source */
/* @SP: ENABLE/DISABLE */
/* @FUNCTION: configure RTC tamper */
int32_t hal_rtc_tamp_config(hal_rtc_dev_struct *rtc_dev, hal_rtc_tamper_config_struct *rtc_tamper_config);

/* @PARA: rtc_timestamp_config */
/* @DEFINE:RTC RTC time stamp event edge */
#define RTC_TIMESTAMP_RISING_EDGE              ((uint32_t)(0x00000000))                /*!< rising edge is valid event edge for time-stamp event */
#define RTC_TIMESTAMP_FALLING_EDGE             RTC_CTL_TSEG                            /*!< falling edge is valid event edge for time-stamp event */
/* @FUNCTION: configure RTC time stamp */
int32_t hal_rtc_timestamp_config(hal_rtc_dev_struct *rtc_dev, uint32_t rtc_timestamp_config);

/* @PARA: rtc_calib_config */
/* @DEFINE:RTC calibration output */
#define RTC_CALIBRATION_NONE                    ((uint8_t)(0))                         /*!< calibration output none */
#define RTC_CALIBRATION_OUTPUT_512HZ            ((uint8_t)(1))                         /*!< calibration output of 512Hz is enable */
#define RTC_CALIBRATION_OUTPUT_1HZ              ((uint8_t)(2))                         /*!< calibration output of 1Hz is enable */
/* @FUNCTION: configure RTC calibration */
int32_t hal_rtc_calib_config(hal_rtc_dev_struct *rtc_dev, uint8_t rtc_calib_config);

/* @PARA: refclock_detection */
/* @SP: ENABLE/DISABLE */
/* @FUNCTION: configure RTC reference clock detection function */
int32_t hal_rtc_refclock_detection_config(hal_rtc_dev_struct *rtc_dev, ControlStatus refclock_detection);
/* @END */

