PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rtc.h
/* hal interface */
/* initialize the RTC structure with the default values */
void hal_rtc_struct_init(hal_rtc_struct_type_enum hal_struct_type, void *p_struct);
/* deinitialize RTC device structure and init structure */
int32_t hal_rtc_deinit(hal_rtc_dev_struct *rtc_dev);
/* enable RTC interrupt */
int32_t hal_rtc_interrupt_enable(hal_rtc_dev_struct *rtc_dev, hal_rtc_irq_struct *p_irq);
/* disable RTC interrupt */
int32_t hal_rtc_interrupt_disable(hal_rtc_dev_struct *rtc_dev);
/* RTC interrupt handler content function,which is merely used in rtc_handler */
void hal_rtc_irq(hal_rtc_dev_struct *rtc_dev);
/* set user-defined interrupt callback function
    which will be registered and called when corresponding interrupt be triggered */
void hal_rtc_irq_handle_set(hal_rtc_dev_struct *rtc_dev, hal_rtc_irq_struct *p_irq);
/* reset all user-defined interrupt callback function,
    which will be registered and called when corresponding interrupt be triggered */
void hal_rtc_irq_handle_all_reset(hal_rtc_dev_struct *rtc_dev);
/* get current time and date */
void hal_rtc_current_time_get(hal_rtc_init_struct *rtc_calendar);
/* get RTC alarm time */
void hal_rtc_alarm_get(hal_rtc_alarm_config_struct *rtc_alarm_time);
/* poll for RTC alarm event */
int32_t hal_rtc_alarm_event_poll(uint32_t timeout_ms);
/* get RTC timestamp time and date */
void hal_rtc_timestamp_get(hal_rtc_timestamp_struct *rtc_timestamp);
/* poll for RTC timestamp event */
int32_t hal_rtc_timestamp_event_poll(uint32_t timeout_ms);
/* poll for RTC tamper0 event */
int32_t hal_rtc_tamper0_event_poll(uint32_t timeout_ms);
/* poll for RTC tamper1 event */
int32_t hal_rtc_tamper1_event_poll(uint32_t timeout_ms);
/* ajust the daylight saving time by adding or substracting one hour from the current time */
void hal_rtc_daylight_saving_time_adjust(uint32_t operation, uint32_t record);

/* simple interface */
/* reset most of the RTC registers */
ErrStatus hals_rtc_deinit(void);
/* enter RTC init mode */
ErrStatus hals_rtc_init_mode_enter(void);
/* exit RTC init mode */
void hals_rtc_init_mode_exit(void);
/* wait until RTC_TIME and RTC_DATE registers are synchronized with APB clock, and the shadow registers are updated */
ErrStatus hals_rtc_register_sync_wait(void);

/* get current subsecond value */
uint32_t hals_rtc_subsecond_get(void);

/* configure subsecond of RTC alarm */
void hals_rtc_alarm_subsecond_config(uint32_t mask_subsecond, uint32_t subsecond);
/* get RTC alarm subsecond */
uint32_t hals_rtc_alarm_subsecond_get(void);
/* enable RTC alarm */
void hals_rtc_alarm_enable(void);
/* disable RTC alarm */
ErrStatus hals_rtc_alarm_disable(void);

/* enable RTC time-stamp */
void hals_rtc_timestamp_enable(uint32_t edge);
/* disable RTC time-stamp */
void hals_rtc_timestamp_disable(void);
/* get RTC time-stamp subsecond */
uint32_t hals_rtc_timestamp_subsecond_get(void);

/* enable RTC tamper */
void hals_rtc_tamper_enable(uint32_t source);
/* disable RTC tamper */
void hals_rtc_tamper_disable(uint32_t source);

/* enable specified RTC interrupt */
void hals_rtc_interrupt_enable(uint32_t interrupt);
/* disble specified RTC interrupt */
void hals_rtc_interrupt_disable(uint32_t interrupt);
/* check specified flag */
FlagStatus hals_rtc_flag_get(uint32_t flag);
/* clear specified flag */
void hals_rtc_flag_clear(uint32_t flag);

/* configure RTC alternate output source */
void hals_rtc_alter_output_config(uint32_t source, uint32_t mode);
/* configure RTC calibration register */
ErrStatus hals_rtc_calibration_config(uint32_t window, uint32_t plus, uint32_t minus);
/* ajust RTC second or subsecond value of current time */
ErrStatus hals_rtc_second_adjust(uint32_t add, uint32_t minus);
/* enable RTC bypass shadow registers function */
void hals_rtc_bypass_shadow_enable(void);
/* disable RTC bypass shadow registers function */
void hals_rtc_bypass_shadow_disable(void);
/* write data to backup register */
int32_t hals_rtc_backup_data_write(uint32_t backup_index, uint32_t data);
/* read data from backup register */
int32_t hals_rtc_backup_data_read(uint32_t backup_index, uint32_t *data);
/* convert from  BCD format to binary format */
uint8_t hals_rtc_bcd_2_normal(uint8_t data);
/* convert from  BCD format to binary format */
uint8_t hals_rtc_normal_2_bcd(uint8_t data);

#endif /* GD32F3X0_HAL_RTC_H */
